Duplicate Method
 Overload List
Name  |   Description
Duplicate(SheetDuplicateOption)
 Duplicates this sheet to generate a new one.
 See Also
  ViewSheet Class
  ViewSheet Members
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →