Viewport Methods
The Viewport type exposes the following members.
Methods
Name | Description
CanAddViewToSheet
 Verifies that the view can be added to the ViewSheet.
Create
 Creates a new Viewport at a given location on a sheet.
GetBoxCenter
 Returns the center of the outline of the viewport on the sheet, excluding the viewport label.
GetBoxOutline
 Returns the outline of the viewport on the sheet, excluding the viewport label.
GetLabelOutline
 Gets the outline viewport's label on the sheet.
GetProjectionToSheetTransform
 Returns the transform from the view's projection space to the sheet space.
HasViewportTransforms
 Indicates if the viewport has transforms.
IsViewIdValidForViewport
 Verifies that the Viewport can change it's view id to the input %viewId%.
SetBoxCenter
 Moves this viewport so that the center of the box outline (excluding the viewport label) is at a given point.
See Also
Viewport Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →