FamilySymbol Properties
The FamilySymbol type exposes the following members.
Properties
Name | Description
Family
 The Family object to which the symbol belongs.
IsActive
 Identifies whether the symbol is active.
StructuralMaterialType
This property returns the physical material from which the type is made.
See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →