Room Methods
The Room type exposes the following members.
Methods
Name | Description
IsPointInRoom
Determines if a point lies within the volume of the room.
Unplace
 Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced.
See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →