ViewSheet Properties
The ViewSheet type exposes the following members.
Properties
Name | Description
IsPlaceholder
 Identifies whether or not the view sheet represents a placeholder sheet.
SheetNumber
 The sheet number of the document.
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →