Room Properties
The Room type exposes the following members.
Properties
Name | Description
BaseOffset
Get or Set the Base Offset of the Room.
ClosedShell
Return the closedShell of the Room.
LimitOffset
Get or Set the Limit Offset of the Room.
UnboundedHeight
Get the Unbounded Height of the Room.
UpperLimit
Get or Set the Upper Limit of the Room.
Volume
Get the Volume of the Room.
See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →