Material Methods
The Material type exposes the following members.
Methods
Name | Description
ClearMaterialAspect
 Removes an aspect from the material.
Create
 Creates a new material.
Duplicate
 Duplicates the material
IsMaterialOrValidDefault
 Validates whether the specified element id is a material element.
IsNameUnique
 Validates whether the material name is unique in document.
SetMaterialAspectByPropertySet
 Sets an aspect of the material to a shared property set.
See Also
Material Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →