ElementType Properties
The ElementType type exposes the following members.
Properties
Name | Description
CanBeCopied
 Determine if this ElementType can create a copy
CanBeDeleted
 Determine if this ElementType can be deleted
CanBeRenamed
 Determine if this ElementType can be renamed
FamilyName
 Gets the family name of this element type.
Name
Set the name for the ElementType.
 (Overrides ElementName.)
See Also
ElementType Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →