Wall Members
The Wall type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CrossSection
 Obtain the Wall Cross-section for this wall.
Width
 Get the overall thickness of the wall.
See Also
Wall Class
Autodesk.Revit.DB Namespace